#+TITLE: Halpha-emitters
*** QSOs
    SCHEDULED: <2021-07-28 qua>

Trying to get the Redshift of the QSOs from simbad.

#+name: QSO-simbad
#+BEGIN_SRC python :tangle /programs/simbad-QSO.py :return asciifile :results file
  from astroquery.simbad import Simbad
  import astropy.coordinates as coord
  import astropy.units as u
  from astropy.table import Table, hstack
  from astropy.coordinates import SkyCoord 
  import numpy as np
  from scipy.constants import constants
  
  # Read the table
  tab = Table.read("iDR3_n4/QSO-simabad.ecsv", format="ascii.ecsv")
  #Looking the objects of the table in Simbad and specifying the column wanted of Simbad
  customSimbad = Simbad()
  customSimbad.get_votable_fields()
  #customSimbad.list_votable_fields()
  customSimbad.add_votable_fields('sptype', 'otype','distance', "velocity")
  customSimbad.add_votable_fields("uvby")
  customSimbad.add_votable_fields('ra(d)', 'dec(d)')
  customSimbad.add_votable_fields('bibcodelist(1990-2020)')#, 'biblio')
  ## get redshift of object
  customSimbad.add_votable_fields("rv_value") 
  result_table = customSimbad.query_region(coord.SkyCoord(tab["RA"], tab["DEC"], 
						 unit=(u.deg, u.deg)), radius = 2.0 * u.arcsec)
  
  #Calculating redshift
  rv = result_table["RV_VALUE"].quantity.data[0]*1000 # rv in m / s
  z = rv / constants.c
  
  result_table["Redshift"] = z
  
  #save the table resulting
  asciifile = "iDR3_n4/QSO-simabad-redshift.ecsv"
  result_table.write(asciifile, format="ascii.ecsv")  
  
#+END_SRC

#+RESULTS: QSO-simbad
[[file:iDR3_n4/QSO-simbad-redshift.ecsv]]

+ <2021-08-03 ter> Making latex file with number of each class of objects with matches on SIMBAD.
  I decided to make the table by hand. So I just will to make a table with the number of
  each class of objects.
  
#+BEGIN_SRC python :return filejson :results file :noweb yes
  import json
  <<simbad-data>>
  dict_class = {"H II regions": len(df_hii),
		"PN": len(df_pn),
		"CV": len(df_cv),
		"SN": len(df_sn),
		"Nova": len(df_nova),
		"BL Lac": len(df_BLLac),
		"RR Lyr": len(df_rrly),
		"Star": len(df_star),
		"WD": len(df_WD),
		"Cluster of Stars": len(df_cl),
		"HMXB": len(df_HMXB),
		"Far-Infrared source": len(df_fir),
		"Eclipsing binary": len(df_EB),
		"Blue object": len(df_Blue),
		"Emission Object": len(df_EmObj),
		"Blue supergiant star": len(df_BlueSG),
		"Low-mass star": len(df_low_mass),
		"UV-emission source": len(df_uv),
		"MIER": len(df_mier),
		"Possible lens Image": len(df_Possible_lensImage),
		"Galaxy": len(df_gal),
		"Galaxy in Pair of Galaxies": len(df_GinPair),
		"Emission line galaxies": len(df_EmG),
		"QSO": len(df_qso),
		"AGN": len(df_agn),
		"Part of a Galaxy": len(df_PartofG),
		"X-ray source": len(df_X),
		"Molecular Cloud": len(df_MolCld),
		"Galaxy in Group of Galaxies": len(df_GinGroup),
		"Radio-source": len(df_Radio),
		"Interacting Galaxies": len(df_IG),
		"Low Surface Brightness Galaxy": len(df_LSB_G),
		"Radio Galaxy": len(df_RadioG),
		"Galaxy in Cluster of Galaxies": len(df_GinCl),
		"High proper-motion Star": len(df_pm),
		"Seyfert 1": len(df_Seyfert_1),
		"Seyfert 2": len(df_Seyfert_2),
		"Brightest galaxy in a Cluster": len(df_bclg),
		"Globular Cluster": len(df_glcl)}
  filejson = "iDR3_n4/simbad-data.json"
  with open(filejson, "w") as f:
      json.dump(dict_class, f, indent=2)
  
#+END_SRC

#+RESULTS:
[[file:iDR3_n4/simbad-data.json]]


+  Now, we need to do the table latex with the Redshift:


#+name: table-qso-redshift
#+BEGIN_SRC python  :return table 
  from astropy.table import Table
  import astropy.coordinates as coord
  import astropy.units as u
  from astropy.coordinates import SkyCoord 
  import sys
  import numpy as np
  
  # Some definitions
  def format_RA(ra):
      return coord.Angle(ra, unit=u.deg).to_string(u.hour, sep=':', precision=2, pad=True)
  
  def format_DEC(dec):
    s = coord.Angle(dec, unit=u.deg).to_string(sep=':', precision=1, pad=True)
    if s.startswith('-'):
	return r'$-$' + s[1:]
    else:
	return s
  
  def coor_fmt(a):
       return "{:.2f}".format(a) 
  
  def z_fmt(z):
      return "{:.2f}".format(z) 
  
  
  # Read the table
  tab = Table.read("iDR3_n4/QSO-simabad.ecsv", format="ascii.ecsv")
  
  # Selected columns
  table = [["ID", "RA", "DEC", "main_type", "redshift"], None]
  
  latex_columns = ['Id Simbad', 'RA', 'DEC',
		 r'Type',
		 r'Redshift'
		 ]
  
  column_formats = {}
  
  column_formats['RA'] = format_RA
  column_formats['DEC'] = format_DEC
  column_formats['redshift'] = z_fmt
  
  tab.sort('RA')
  id_ = tab["main_id"]
  ra = tab["RA"]
  dec = tab["DEC"]
  main = tab["main_type"]
  red = tab["redshift"]
  
  for a, b, c, d, e in zip(id_, ra, dec, main, red):
      table.append([a, b, c, d, e])
  
#+END_SRC

#+RESULTS: table-qso-redshift
| ID                           |                 RA |                 DEC | main_type     | redshift |
|------------------------------+--------------------+---------------------+---------------+----------|
| QSO B2359+005                | 0.6279554824066291 |  0.8331230804411939 | QSO           |  1.35421 |
| SDSS J000637.99-003656.2     |  1.658281373282977 | -0.6156060790712984 | QSO           |    4.435 |
| LBQS 0004+0036               |  1.791687271704504 |  0.8914261244525057 | QSO           |  0.31564 |
| SDSS J000809.34+004935.5     |  2.038930048182944 |  0.8264638152844974 | QSO           |    3.293 |
| [VV2006] J001040.1-294428    |  2.666987531261032 | -29.740921877458867 | QSO           |    1.361 |
| [VV2006] J001228.8-310241    | 3.1199364195988752 |  -31.04443153319788 | QSO           |     1.36 |
| 2SLAQ J001526.52+001813.2    |  3.860510825587982 |  0.3037236200425542 | QSO           |   1.3623 |
| [VV2006] J001535.5+005355    |  3.898110576074378 |  0.8989176411595012 | QSO           |  1.35826 |
| [VV2006] J001641.9-312657    |  4.174451424491121 |  -31.44905004903269 | QSO           | 0.360399 |
| 2SLAQ J001731.27-004859.3    |  4.380258459418438 | -0.8164386494043362 | QSO           |  1.35653 |
| SDSS J001753.82+005057.6     |  4.474256625814649 |  0.8493703288672522 | QSO           | 1.357714 |
| 2SLAQ J001912.39+000319.6    |  4.801640792188885 |  0.0554916881824542 | QSO           |   1.3718 |
| 2SLAQ J001940.23-005435.9    |  4.917646791908225 | -0.9099503373848068 | QSO           |   1.3739 |
| [VV2006] J001950.1-004040    |  4.958578954314056 | -0.6779700699260857 | QSO           |     4.34 |
| 2SLAQ J002237.90+000519.0    |  5.657902318221463 |  0.0886788337120439 | QSO           |   1.3727 |
| SDSS J002940.01+010528.5     |  7.416749471161749 |  1.0913027872498264 | QSO           |    1.387 |
| SDSS J003117.70+001705.0     |  7.823701945596341 |  0.2847385223835051 | QSO           |  4.33499 |
| 2SLAQ J003208.53-005303.7    |  8.035561688713287 | -0.8843461346218345 | QSO           |   1.3436 |
| SDSS J003234.62-001557.1     |  8.144241522878199 | -0.2658504803749659 | QSO           |    3.243 |
| [VV2006] J003242.7+003111    |  8.178072183921541 |  0.5197450140043085 | QSO           |  0.36039 |
| [VV2006] J003545.9+002306    |  8.941080203860544 |  0.3849934246315855 | QSO           |  3.23707 |
| [VV2006] J003714.1-005602    |  9.308785545285224 | -0.9344374247364892 | QSO           | 4.361334 |
| [VV2006] J003722.2-001140    |  9.342361420176386 | -0.1946009608261733 | QSO           |  1.37028 |
| SDSS J003859.34-004252.2     |  9.747289111980264 |  -0.714454350224955 | QSO           |  2.50232 |
| GALEX 2673249256393934953    | 10.682789961127495 |   1.283933341653539 | QSO           | 1.366473 |
| SDSS J004415.83-004303.1     | 11.065875879315966 |  -0.717518646194803 | QSO           |    3.248 |
| [VV2006] J004544.4-315729    | 11.434797546075147 |  -31.95811304109312 | QSO           |    1.344 |
| [VV98] J004826.9-341340      | 12.112387692202818 |  -34.22741726899439 | QSO           |     1.91 |
| SDSS J004918.52+011308.9     |  12.32716144605164 |  1.2191920530524625 | QSO           |   1.3385 |
| QSO B0049-272                |  12.98183382570476 | -26.962028288894874 | QSO           |    2.484 |
| SDSS J005343.78+012147.6     |  13.43231563480846 |   1.363190953245345 | QSO           |  1.35759 |
| QSO B0052-307                | 13.683104869130515 |  -30.51502373758133 | QSO           |     2.45 |
| [VV2006] J005532.1-311538    | 13.883649917774902 | -31.260498014964096 | QSO           |     1.35 |
| [VV2006] J005609.9-312209    |  14.04137683954713 |  -31.36906110248861 | QSO           |     2.46 |
| [VV2006] J005639.0-315759    | 14.162698397718229 |  -31.96627152132016 | QSO           |     1.35 |
| [VV2000] J005840.5-300203    | 14.668422466041417 |  -30.03336355079838 | QSO           |   1.3614 |
| LBQS 0057-0135               | 14.953354509073169 | -1.3181152771969302 | QSO           |    0.325 |
| QSO B0057-3948               | 14.971706058633467 |  -39.53259262490825 | QSO           |     3.24 |
| QSO B0059-304B               | 15.561054131595537 |  -30.13160407774772 | QSO           |     3.24 |
| [VV2006] J010336.4-005508    | 15.901621012754958 | -0.9191165595206996 | QSO           |   2.4428 |
| SDSS J010413.86-011552.1     |  16.05775922175709 |  -1.264431931617225 | QSO           | 1.365982 |
| QSO B0103+00                 | 16.580131544341818 |  0.8064950808416276 | QSO           |  4.43489 |
| [VV2006] J010705.6+000609    |  16.77312563028888 |  0.1024885367041135 | QSO           |  1.35705 |
| 2SLAQ J010907.59+000649.8    |  17.28164156677598 |  0.1138851962867193 | QSO           |   1.3722 |
| SDSS J010918.56+005419.3     |  17.32733457723796 |    0.90539845012828 | QSO           | 1.356154 |
| 2SLAQ J010925.95-003739.0    |  17.35815775854618 | -0.6275003706886488 | QSO           | 1.359816 |
| SDSS J011128.38+000143.7     |  17.86813658313074 |  0.0286974483465913 | QSO           | 0.765336 |
| 2SLAQ J011230.55+001441.5    |  18.12729657912228 |  0.2449304176402998 | QSO           |  3.25884 |
| [VV2006] J011405.3-310903    | 18.521860772867413 | -31.150780875277498 | QSO           |    1.333 |
| 2SLAQ J011542.18+002300.2    |  18.92575064401607 |  0.3834537397700357 | QSO           |   1.3726 |
| 2SLAQ J011818.13+001455.2    |  19.57552004108609 |  0.2487480482840988 | QSO           | 1.371634 |
| 2SLAQ J012110.74-005037.2    |  20.29473653398262 | -0.8436434200227299 | QSO           | 1.351602 |
| 2SLAQ J012226.76+000327.5    | 20.611445353426262 |  0.0577366753714225 | QSO           |  2.48045 |
| QSO B0120-002                |  20.75741214062869 |  0.0565525553589094 | QSO           |  1.35617 |
| QSO B0121-324                | 21.067433955055776 |  -32.20603385094096 | QSO           |    1.358 |
| QSO B0122-3232               |  21.26913199118856 |  -32.28740231179497 | QSO           |     2.45 |
| SDSS J013034.18-002106.6     | 22.642393025135533 | -0.3518162354106257 | QSO           |   3.2343 |
| [VV2006] J013500.8-004054    | 23.753457358462345 | -0.6817256241073724 | QSO           |  1.00706 |
| SDSS J013701.72-012059.3     | 24.257111717644538 | -1.3497465276851617 | QSO           |    2.496 |
| [VV2006] J013729.4-320715    |   24.3725070057774 |  -32.12103455786598 | QSO           |    1.368 |
| [VV2006] J013837.3+002818    | 24.655329021886622 |  0.4717925959967649 | QSO           |  1.34801 |
| 2SLAQ J013951.07+002537.9    | 24.962782843879992 |  0.4272217892643302 | QSO           | 1.341863 |
| SDSS J014125.63+000755.6     |  25.35682525075279 |  0.1321647769641862 | QSO           | 0.322432 |
| [VV2006] J014224.7-320414    |  25.60303358518956 |  -32.07047314351019 | QSO           |     2.46 |
| [VV2006] J014303.6-295255    | 25.764557663482428 |  -29.88188949191848 | QSO           |     2.45 |
| SDSS J014721.12-004505.3     |  26.83799104587179 | -0.7514735524191466 | QSO           | 1.348128 |
| [VV2006] J014739.2-285259    | 26.913386215352126 | -28.883097657544933 | QSO           |     0.36 |
| [VV2006] J014739.2-285259    |   26.9133952038632 |  -28.88312791748778 | QSO           |     0.36 |
| [VV2006] J014812.2+000154    |  27.05101817682357 |  0.0315348188803727 | QSO           |    1.712 |
| [VV2006] J014921.5-003220    |  27.33969542295298 | -0.5391525524002503 | QSO           |  1.37898 |
| 2SLAQ J015331.85+002252.8    |  28.38271202195532 |  0.3813754396509161 | QSO           |   1.3674 |
| 2SLAQ J015409.27+002645.2    |  28.53861595248377 |  0.4459129033998668 | QSO           |    1.355 |
| [VV2006] J015410.9-285214    | 28.545594305017943 | -28.870735753209058 | QSO           |    1.356 |
| [VV2006] J015415.4-285254    | 28.564494450701485 |   -28.8819264781154 | QSO           |    1.344 |
| [VV2006] J015832.1-301703    |  29.63394027051608 | -30.284120909894927 | QSO           |     1.38 |
| [VV2006] J015832.1-301703    |  29.63398878244968 |  -30.28409277206394 | QSO           |     1.38 |
| [VV2006] J015850.2-300438    |  29.70926847240945 | -30.077239118059776 | QSO           |    1.351 |
| [VV2006] J015935.4+000401    |  29.89784479360552 |  0.0670730705671857 | QSO           |   3.2768 |
| SDSS J020025.40+002916.5     | 30.105854148548683 |  0.4879895823228443 | QSO           |   0.3126 |
| [VV2006] J020055.0-293527    |  30.22926062206253 |  -29.59069575111854 | QSO           |    1.349 |
| [VV98] J020115.4+003136      |  30.31471271654344 |  0.5264157435180954 | QSO           |   0.3625 |
| 2SLAQ J020200.06-000921.2    | 30.500247645814035 |  -0.155885605135301 | QSO           |   1.3589 |
| [VV96] J020435.5-455923      |  31.14774462904211 |  -45.99000661095606 | QSO           |     3.24 |
| 2SLAQ J020804.48-000023.2    |  32.01870359151427 | -0.0063899756832095 | QSO           |   1.3394 |
| 2SLAQ J020827.06-005208.1    |  32.11278143734105 | -0.8688706450161886 | QSO           |   1.3414 |
| SDSS J020921.99-005455.5     |  32.34166379711758 | -0.9153964683450352 | QSO           |   1.3666 |
| 2SLAQ J021529.02-005314.8    |  33.87092614743144 | -0.8874609989930496 | QSO           |   1.3686 |
| SDSS J021617.19-011046.9     |  34.07162177605453 |   -1.17963313592842 | QSO           |   3.2639 |
| 2SLAQ J021810.52-010147.4    | 34.543835265892945 | -1.0297901208560476 | QSO           |   1.3534 |
| [VV2006] J022738.3-313627    |  36.90951623742346 | -31.607345845404307 | QSO           |     1.35 |
| [VV2006] J022758.2+000226    |  36.99250641431996 |  0.0404421118141437 | QSO           |    1.066 |
| SDSS J023230.63-011654.5     |  38.12763748929023 | -1.2817952492366265 | QSO           |    1.364 |
| [VV2006] J023335.4-010744    |  38.39735766972906 | -1.1290537121536242 | QSO           |   0.3675 |
| [VV2006] J023635.7-003203    |  39.14871940890983 | -0.5342706372644691 | QSO           |    1.362 |
| SDSS J024059.15+004545.8     |  40.24643683967374 |  0.7627476177593495 | QSO           |    3.233 |
| [VV2006] J024235.0-010351    |   40.6454475160122 | -1.0644227483678184 | QSO           |    1.373 |
| Gaia DR2 2497764348684940160 |  41.60311859466317 | -0.5045181639339942 | QSO           |   masked |
| 2SLAQ J025100.64+001707.2    |  42.75267977777988 |  0.2853735115843281 | QSO           |  2.46635 |
| 2SLAQ J025252.02-002211.7    |  43.21668023139433 | -0.3698979850578264 | QSO           | 1.370345 |
| QSO B0253+0058               | 44.030210339218165 |  1.1774555299992029 | QSO           |    1.349 |
| LBQS 0302-0019               |  46.20769411378219 | -0.1370507568661265 | QSO           |    3.295 |
| LBQS 0303+0110               |  46.55298185202796 |  1.3659244829765935 | QSO           |    1.335 |
| 2SLAQ J030757.55+000712.0    |  46.98979992986573 |   0.120017369478221 | QSO           |  1.34257 |
| 2SLAQ J031129.69-001701.4    |  47.87373270347458 | -0.2837361426333072 | QSO           |   1.3566 |
| [VV2006] J031845.2-001844    |  49.68820265523018 | -0.3125867996899615 | QSO           |  3.22419 |
| 2SLAQ J031937.30-002641.1    | 49.905357996326025 | -0.4447129467729893 | QSO           |   1.3705 |
| SDSS J032244.90+004442.4     |  50.68707745560916 |  0.7450965554947673 | QSO_Candidate |  0.30433 |
| SDSS J033226.29-011126.2     |  53.10952432881614 | -1.1905549158813071 | QSO           |   1.3613 |
| SDSS J033226.29-011126.2     |  53.10958810574174 |  -1.190642242028551 | QSO           |   1.3613 |
| [VV2006] J033458.5-000744    |  53.74365145217437 | -0.1288517115468432 | QSO           |  1.35731 |
| [VV2006] J033821.6+003106    |  54.58960430404596 |  0.5184971700047292 | QSO           |  1.34902 |
| [VV2006] J033927.5-344707    |  54.86439460038415 |  -34.61862342769125 | QSO           |    1.364 |
| [VV2006] J034023.0-351606    |  55.09580981936138 |  -35.26861884407053 | QSO           |    1.372 |
| [VV2006] J034408.3-003106    |  56.03437204036832 | -0.5182824235374773 | QSO           |  1.64556 |
| SDSS J034517.02-001549.8     |  56.32088432677072 | -0.2638128432166242 | QSO           |   1.3345 |
| QSO B0401-3505               | 60.794009739694005 |  -34.94910807950281 | QSO           |    3.251 |
| [VV96] J041130.5-335331      | 62.877144254160285 |  -33.89197020875841 | QSO           |     1.35 |
| 2QZ J100215.7-001056         | 150.56596957389203 | -0.1821573352244082 | QSO           |    0.353 |
| [VV96] J100342.1-150808      |  150.9246975604601 | -15.135802684821307 | QSO           |    0.342 |
| [VV2006] J100539.9+040914    | 151.41616300935794 |   4.154090690739466 | QSO           |  1.35528 |
| [VV96] J101821.7-214008      | 154.59067560656675 |  -21.66881849744636 | QSO           |     2.47 |
| [VV96] J111644.8-171127      |  169.1815896684582 | -17.194855188675877 | QSO           |    0.375 |
| LBQS 1136-0109               |  174.7681233226218 | -1.4402891840929772 | QSO           |  1.37545 |
| SDSS J114329.34-020319.7     |  175.8722683259682 | -2.0554055350002094 | QSO           |   3.3035 |
| SDSS J114329.34-020319.7     |  175.8722971552406 | -2.0555300405054746 | QSO           |   3.3035 |
| SDSS J114643.10+011118.6     |  176.6796613966468 |  1.1885571745316508 | QSO           |   3.2202 |
| [VV2006] J114939.6+014624    | 177.41500197480892 |   1.773741489322032 | QSO           |  1.36233 |
| [VV2006] J115049.2-005149    | 177.70537423275803 | -0.8636364611502556 | QSO           |    1.354 |
| [VV2006] J115345.5-024320    |  178.4393258721732 |  -2.722344158881375 | QSO           |    1.347 |
| [VV2006] J115748.0+014320    |  179.4500979791226 |   1.722464633451602 | QSO           |  1.36426 |
| [VV2006] J115754.2-013815    | 179.47609913312544 | -1.6377672684560611 | QSO           |     4.38 |
| SDSS J120021.76-024331.0     |  180.0906960738449 |   -2.72525835885637 | QSO           |   3.2477 |
| [VV2006] J120038.3+011246    | 180.15952618608105 |  1.2129112212203663 | QSO           |  1.35786 |
| QSO B1158-1842               |  180.1873094362587 | -18.995686347147792 | QSO           |    2.453 |
| QSO B1158+007                | 180.34692325828544 |  0.4745788784794196 | QSO           |   1.3693 |
| [VV2006] J120700.4+011155    |  181.7517098625927 |  1.1990112046487067 | QSO           |     1.52 |
| SDSS J120920.53-002855.3     | 182.33562177580043 | -0.4820361729402547 | QSO           |  3.23735 |
| [VV2006] J121010.8-003909    |   182.545072752764 | -0.6527062334835679 | QSO           |    1.008 |
| SDSS J121435.24-015924.4     |  183.6469096827458 |  -1.990114618560348 | QSO           |    3.233 |
| [VV2006] J121515.2-013542    | 183.81343790615867 | -1.5946745490378629 | QSO           |     1.35 |
| QSO B1216+0216               | 184.73251321873693 |  2.0005938638657152 | QSO           |  0.32709 |
| [VV2006] J121942.5-001821    |  184.9269721119905 | -0.3059539785935566 | QSO           |  1.33689 |
| [VV2006] J122130.9+010727    | 185.37906214223312 |   1.124474721489336 | QSO           |  1.36996 |
| 2SLAQ J122421.12+002354.1    | 186.08805453702857 |  0.3984481006440221 | QSO           |   0.3337 |
| [VV2006] J122625.7+011604    |  186.6069592196776 |   1.267941658397558 | QSO           |  2.47811 |
| [VV2006] J122707.1+010811    | 186.77970923418985 |  1.1364780564297168 | QSO           |  2.18919 |
| [VV96] J130243.5-135553      | 195.68164279128675 | -13.931326571318332 | QSO           |    1.391 |
| QSO B1317-122                | 199.99667654428632 | -12.487991060254044 | QSO           |    0.329 |
| SDSS J132023.46-004730.9     |  200.0977807916915 | -0.7918937289501875 | QSO           |    3.255 |
| QSO B1352-104                | 208.69386729420503 | -10.684057890909807 | QSO           |     0.33 |
| [VV2006] J135602.8-022624    |  209.0116324685152 | -2.4398085262225853 | QSO           |    1.373 |
| 2MASS J14265388+0525172      |  216.7245347178442 |   5.421495966728137 | QSO           |  0.32283 |
| SDSS J145344.51+045645.8     | 223.43549771425327 |   4.946107899138475 | QSO           |  3.32837 |
| SDSS J200143.74+004918.4     |  300.4321955778412 |  0.8217833390436116 | QSO           |   masked |
| SDSS J202906.80+005453.5     |  307.2783691077352 |  0.9148870344062292 | QSO           |   masked |
| SDSS J204626.10+002337.7     |  311.6087878150387 |  0.3938280343112397 | QSO           |   0.3323 |
| [VV2006] J204956.6-001201    |  312.4859068430339 | -0.2004724242450093 | QSO           |  0.36928 |
| [VV2006] J204956.6-001201    | 312.48592414481044 |  -0.200477643373699 | QSO           |  0.36928 |
| [VV2006] J205316.7+005920    |  313.3198559349733 |  0.9892076810353208 | QSO           |  4.29875 |
| 2SLAQ J205352.03-001601.5    |   313.466816984702 | -0.2670765601766264 | QSO           |  0.36263 |
| 2SLAQ J205712.69+001211.3    |   314.302863294349 |  0.2031735829473498 | QSO           |    0.335 |
| SDSS J205740.76+005418.5     |  314.4198074848838 |  0.9052857685742688 | QSO           |    0.332 |
| QSO B2059-330                |  315.6737967478414 |  -32.87890999401036 | QSO           |     3.28 |
| QSO B2059-330                | 315.67381555407934 |  -32.87898718209263 | QSO           |     3.28 |
| LBQS 2128-4555               |  322.8730471709395 | -45.697352338099286 | QSO           |    0.623 |
| 2MASS J21333817+0126291      |   323.408936906668 |  1.4413770493499043 | QSO           |   1.0044 |
| SDSS J213455.08+001056.9     | 323.72952597635833 |  0.1824349898807966 | QSO           |   3.2888 |
| WISEA J213649.75-012852.2    | 324.20730055187585 |  -1.481159088195661 | QSO           |     3.28 |
| QSO B2134-453                | 324.53121345495185 |  -45.13834354299933 | QSO           |     4.36 |
| 2SLAQ J214106.46+004733.3    |  325.2768379376971 |  0.7926481060166569 | QSO           |  2.45201 |
| SDSS J214155.04-011734.3     | 325.47932878054104 |  -1.292825833976646 | QSO           |    3.286 |
| SDSS J214155.04-011734.3     |   325.479329853818 |  -1.292849791540993 | QSO           |    3.286 |
| SDSS J215002.69+011343.8     |  327.5112425223878 |  1.2288440704579693 | QSO           |  3.26748 |
| 2SLAQ J215010.52-001000.6    | 327.54385873207247 | -0.1668265647596742 | QSO           |  0.33481 |
| 2SLAQ J220529.34-003110.6    | 331.37225331383246 | -0.5196269942518518 | QSO           |  2.45421 |
| [VV2006] J220852.0-010603    |  332.2165318654766 | -1.1010232176217527 | QSO           |  0.35149 |
| [VV2006] J220852.0-010603    | 332.21654479357403 | -1.1010212789856892 | QSO           |  0.35149 |
| 2dFGRS TGS061Z180            |  332.3293752575985 |  -24.12012102380704 | QSO           |     0.32 |
| SDSS J220954.57-012717.6     |  332.4773666618215 |  -1.454892271729591 | QSO           |   3.2958 |
| [VV2006] J221335.7-282542    |  333.3985380422876 |  -28.42824210005132 | QSO           |    2.469 |
| [VV2006] J221532.6-281805    | 333.88574209843875 | -28.301075647502863 | QSO           |     1.33 |
| [VV2006] J221722.5+010436    |  334.3435194955581 |  1.0767543256819685 | QSO           |  1.40302 |
| 2SLAQ J222332.83-010614.8    | 335.88681821013813 |   -1.10412204251795 | QSO           |  2.45971 |
| 2SLAQ J222403.36-005724.2    | 336.01397097341777 | -0.9567096099850134 | QSO           |  0.31339 |
| 2SLAQ J222403.36-005724.2    | 336.01401051604205 | -0.9566969699045356 | QSO           |  0.31339 |
| SDSS J222923.00-020042.7     |  337.3458366571309 |  -2.011785900315515 | QSO           |   3.2941 |
| 2SLAQ J222956.53+003126.5    | 337.48557309949206 |  0.5240235390794395 | QSO           |   1.3403 |
| [VV2006] J223251.7-303250    |  338.2155980841278 |  -30.54711277145381 | QSO           |     0.35 |
| [VV2006] J223633.5+002652    |   339.139729783869 |  0.4480037094611175 | QSO           |  1.35407 |
| SDSS J223649.60+005413.5     | 339.20666171031564 |  0.9038310163367896 | QSO           |   3.3132 |
| PHL   354                    |  339.5968891921001 |  -0.952268013442764 | QSO           |  0.36059 |
| PHL   354                    |  339.5969264365535 | -0.9522370681869864 | QSO           |  0.36059 |
| 2SLAQ J223844.30-005655.3    |  339.6845594683822 |  -0.948694319373839 | QSO           |   1.3575 |
| 2SLAQ J224531.20-004509.4    |  341.3799824113044 | -0.7526108924743485 | QSO           |   1.3679 |
| 2SLAQ J224531.20-004509.4    |  341.3799836615205 | -0.7525947660724432 | QSO           |   1.3679 |
| SDSS J224539.94-002419.7     |  341.4164203070588 | -0.4054482118161328 | QSO           |  3.28047 |
| 2MASS J22495608+0002182      |  342.4836663184702 |  0.0384316128868782 | QSO           |  3.30735 |
| SDSS J225149.74-002811.7     | 342.95730339479854 | -0.4698259059306293 | QSO           |    3.228 |
| [VV2006] J225411.2-312712    | 343.54646400880233 |  -31.45314972730561 | QSO           |     1.36 |
| SDSS J225411.96-004949.5     |  343.5498267824822 | -0.8303920878390473 | QSO           |   3.2973 |
| SDSS J225411.96-004949.5     |  343.5498379046172 | -0.8303498619565828 | QSO           |   3.2973 |
| 2SLAQ J230201.20+003047.2    |  345.5049924642404 |  0.5131468261640252 | QSO           |   1.3443 |
| [VV2006] J230235.5-285630    |  345.6476494287596 | -28.941580257566937 | QSO           |    0.368 |
| 2SLAQ J230316.40-001211.5    |  345.8183544369748 | -0.2031687049072709 | QSO           |   1.5162 |
| SDSS J230428.31+005701.2     |  346.1180884490532 |   0.950341888510796 | QSO           | 0.316817 |
| 2SLAQ J230444.16-010251.7    |  346.1839995707146 |  -1.047637756170335 | QSO           |    1.377 |
| SDSS J230855.49+003705.6     |   347.231188850614 |  0.6182549476788003 | QSO           |  1.78377 |
| [VV2006] J230914.4-305913    |  347.3096188733344 | -30.986794418426523 | QSO           |     1.38 |
| [VV2006] J231135.1-312644    |  347.8963319528839 | -31.445592377850765 | QSO           |     1.35 |
| 2SLAQ J231231.36-011137.5    | 348.13067741527794 | -1.1937043288787734 | QSO           |   1.3596 |
| SDSS J231259.07+010805.6     |  348.2461021601764 |  1.1349593899913708 | QSO           |   3.2954 |
| [VV2006] J231311.9-004538    |   348.299611065616 | -0.7605497687369258 | QSO           |  1.36397 |
| [VV2006] J231519.4-303857    |  348.8308033561476 |  -30.64921915522369 | QSO           |    1.356 |
| [VV2006] J231652.0+005125    |  349.2168428172675 |  0.8571987065141106 | QSO           |  3.22906 |
| [VV2006] J231942.8-302629    | 349.92814830462225 |  -30.44152729995124 | QSO           |    2.473 |
| 2SLAQ J232457.75+002153.2    |  351.2406451424701 |  0.3648363114586009 | QSO           |  0.34462 |
| SDSS J233104.38-004237.2     |   352.768315319454 | -0.7102948577467144 | QSO           |   1.3532 |
| SDSS J233300.21-002030.5     | 353.25093145251367 | -0.3418033383059611 | QSO           |  3.32785 |
| [VV2006] J233438.5+002341    |   353.660612982189 |  0.3949855898346673 | QSO           |  1.38496 |
| 2SLAQ J233522.69-000635.2    |  353.8445277828368 | -0.1097797881436761 | QSO           |   1.3726 |
| [VV2006] J233722.0+002239    |  354.3417350883094 |  0.3775467635964666 | QSO           |  1.37666 |
| [VV2006] J234329.1-300200    |  355.8714951658231 |  -30.03336765255501 | QSO           |    1.358 |
| [VV2006] J235546.2-002342    |  358.9422665997112 | -0.3952102105534735 | QSO           |  3.24518 |
| [VV2006] J235718.4+004350    | 359.32653511559846 |  0.7307049350125405 | QSO           |    4.366 |
| SDSS J235805.25-012153.9     |  359.5218549462989 | -1.3649719892078715 | QSO           | 1.367518 |


**** Redshift
According with [[https://ui.adsabs.harvard.edu/abs/2020A%26A...633A.123G/abstract][Gutiérrez-Soto et al (2021)]] the redshift range where important
emission line of the QSO fall into the J0660 filter are:
+ 1.3 < z < 1.4 -> MgII
+ 2.4 < z < 2.6 -> CIII]
+ 3.2 < z < 3.4 -> CIV 


#+BEGIN_SRC sh
  pip install constants
#+END_SRC

#+RESULTS:
| Collecting   | constants              |                 |                                                                                        |                                           |           |                                                                         |        |        |
| Downloading  | constants-0.6.0.tar.gz | (5.1            | kB)                                                                                    |                                           |           |                                                                         |        |        |
| Building     | wheels                 | for             | collected                                                                              | packages:                                 | constants |                                                                         |        |        |
| Building     | wheel                  | for             | constants                                                                              | (setup.py):                               | started   |                                                                         |        |        |
| Building     | wheel                  | for             | constants                                                                              | (setup.py):                               | finished  | with                                                                    | status | 'done' |
| Created      | wheel                  | for             | constants:                                                                             | filename=constants-0.6.0-py3-none-any.whl | size=5458 | sha256=a711a23bba1fafd7bbb2e4bc83d9b97b11370a83fd5ce9bef79882b9dca9b262 |        |        |
| Stored       | in                     | directory:      | /home/luis/.cache/pip/wheels/77/ac/b2/89268490b92bf6fd0102b3634668042437e0e024c64ef447a1 |                                           |           |                                                                         |        |        |
| Successfully | built                  | constants       |                                                                                        |                                           |           |                                                                         |        |        |
| Installing   | collected              | packages:       | constants                                                                              |                                           |           |                                                                         |        |        |
| Successfully | installed              | constants-0.6.0 |                                                                                        |                                           |           |                                                                         |        |        |

Now we need to do the table latex with the Redshift

*** GAIA distance from Bailer-Jones et al. 2021
    I used  =rgeo= =[pc]=, Median of the geometric distance posterior, in Vizier is =I/352/gedr3dis=.
    But I discovered that =rpgeo= =[pc]=, median photogeotric distance is better.

#+name: read-gaia-distance-table
#+BEGIN_SRC python
  df_dis = pd.read_csv("Gaia-distance-Final-list-emitters-allparam-unique.csv")
#+END_SRC

#+name: qso-read-gaia-distance-table
#+BEGIN_SRC python
  df_qso_dis = pd.read_csv("GAIA-QSO-distance-simbad-final.csv")
#+END_SRC

#+name: cv-read-gaia-distance-table
#+BEGIN_SRC python
  df_cv_dis = pd.read_csv("GAIA-CV-distance-simbad-final-all.csv")
#+END_SRC

+ Number of known QSO with < 4.0 kpc.

#+BEGIN_SRC python :results output
  import pandas as pd
  import numpy as np
  <<qso-read-gaia-distance-table>>
  <<qso-read-gaia-table>>
  d_qso = np.array(df_qso_dis["rpgeo"]) / 1000.
  d_qso_para = 1 / df_qso["parallax"] 

  mask1 = d_qso < 4.0
  mask2 = (d_qso_para >= 0.0) & (d_qso_para <= 4.0)

  d_baler_4 = d_qso[mask1]
  d_para_4 = d_qso_para[mask2]
  df_qso_dis = df_qso_dis[mask1]
   
  print("Number with QSO dist Bailer:", len(d_qso))
  print("Number of QSO dist Bailer < 4:", len(d_baler_4))
  print("QSO dist para < 4:", df_qso_dis)
  print("Number of QSO dist para < 4:", len(d_para_4))
#+END_SRC

#+RESULTS:
#+begin_example
Number with QSO dist Bailer: 195
Number of QSO dist Bailer < 4: 51
QSO dist para < 4:            Field_1                       ID_1  ...  angDist_x  Separation
2    STRIPE82-0059  iDR3.STRIPE82-0059.038992  ...   0.566643    0.065479
18   STRIPE82-0026  iDR3.STRIPE82-0026.037373  ...   0.113735    0.001844
34   STRIPE82-0148  iDR3.STRIPE82-0148.001139  ...   0.232503    0.007212
42    SPLUS-s24s63   iDR3.SPLUS-s24s63.042079  ...   0.125154    0.002383
44    SPLUS-s25s10   iDR3.SPLUS-s25s10.029368  ...   0.201177    0.000794
46    SPLUS-n01s23   iDR3.SPLUS-n01s23.038457  ...   0.233618    0.001082
47    SPLUS-n02n22   iDR3.SPLUS-n02n22.059209  ...   0.142526    0.008874
52   STRIPE82-0007  iDR3.STRIPE82-0007.021121  ...   0.181081    0.013351
57   STRIPE82-0020  iDR3.STRIPE82-0020.053566  ...   0.214332    0.007772
58   STRIPE82-0025  iDR3.STRIPE82-0025.031694  ...   0.100877    0.002831
66   STRIPE82-0068  iDR3.STRIPE82-0068.006406  ...   0.060903    0.007206
67   STRIPE82-0069  iDR3.STRIPE82-0069.058305  ...   0.086811    0.013725
69   STRIPE82-0088  iDR3.STRIPE82-0088.084531  ...   0.184650    0.152283
70   STRIPE82-0106  iDR3.STRIPE82-0106.052252  ...   0.170349    0.008704
74   STRIPE82-0143  iDR3.STRIPE82-0143.016256  ...   0.151043    0.004418
76   STRIPE82-0152  iDR3.STRIPE82-0152.022237  ...   0.184347    0.009439
84    SPLUS-s23s47   iDR3.SPLUS-s23s47.008417  ...   0.168306    0.004188
99   STRIPE82-0018  iDR3.STRIPE82-0018.064634  ...   0.184620    0.008528
100  STRIPE82-0020  iDR3.STRIPE82-0020.062391  ...   0.510505    0.002964
104  STRIPE82-0028  iDR3.STRIPE82-0028.012953  ...   0.168322    0.013831
105  STRIPE82-0029  iDR3.STRIPE82-0029.026431  ...   0.157528    0.000837
106  STRIPE82-0032  iDR3.STRIPE82-0032.003058  ...   0.426510    0.007891
110  STRIPE82-0042  iDR3.STRIPE82-0042.016294  ...   0.126869    0.010938
111  STRIPE82-0044  iDR3.STRIPE82-0044.002332  ...   0.153183    0.007341
117  STRIPE82-0062  iDR3.STRIPE82-0062.010390  ...   0.191612    0.014489
122  STRIPE82-0081  iDR3.STRIPE82-0081.034915  ...   0.117840    0.002038
123  STRIPE82-0081  iDR3.STRIPE82-0081.053377  ...   0.169321    0.008718
130  STRIPE82-0151  iDR3.STRIPE82-0151.013776  ...   0.189094    0.006743
140   SPLUS-s23s20   iDR3.SPLUS-s23s20.028661  ...   0.321053    0.027919
142   SPLUS-s24s10   iDR3.SPLUS-s24s10.009259  ...   0.193704    0.013043
143   SPLUS-s24s10   iDR3.SPLUS-s24s10.013024  ...   0.205006    0.010667
147   SPLUS-s24s70   iDR3.SPLUS-s24s70.037609  ...   0.200823    0.012105
156   SPLUS-n02n27   iDR3.SPLUS-n02n27.026395  ...   0.231241    0.007546
157   SPLUS-n02s21   iDR3.SPLUS-n02s21.038093  ...   0.293812    0.043273
158   SPLUS-n03s21   iDR3.SPLUS-n03s21.031094  ...   0.195212    0.008589
161  STRIPE82-0002  iDR3.STRIPE82-0002.030464  ...   0.139954    0.003905
164  STRIPE82-0017  iDR3.STRIPE82-0017.024243  ...   0.255920    0.003983
165  STRIPE82-0026  iDR3.STRIPE82-0026.006093  ...   0.162860    0.004288
167  STRIPE82-0035  iDR3.STRIPE82-0035.022844  ...   0.144779    0.012272
171   SPLUS-n03s23   iDR3.SPLUS-n03s23.033092  ...   0.177323    0.041208
173  STRIPE82-0008  iDR3.STRIPE82-0008.034263  ...   0.150893    0.044824
176  STRIPE82-0058  iDR3.STRIPE82-0058.035027  ...   0.196080    0.067941
177  STRIPE82-0142  iDR3.STRIPE82-0142.034401  ...   0.245332    0.026299
179   SPLUS-s23s20   iDR3.SPLUS-s23s20.009264  ...   0.115496    0.000992
180   SPLUS-n02n27   iDR3.SPLUS-n02n27.022071  ...   0.073249    0.019058
181   SPLUS-n02s19   iDR3.SPLUS-n02s19.000577  ...   0.267068    0.025793
183  STRIPE82-0004  iDR3.STRIPE82-0004.031191  ...   0.238220    0.009249
184  STRIPE82-0104  iDR3.STRIPE82-0104.027921  ...   0.102429    0.002602
190   SPLUS-s19s33   iDR3.SPLUS-s19s33.032618  ...   0.236020    0.005759
191  STRIPE82-0053  iDR3.STRIPE82-0053.044359  ...   0.231527    0.004083
192   SPLUS-s21s10   iDR3.SPLUS-s21s10.048904  ...   0.179287    0.010906

[51 rows x 172 columns]
Number of QSO dist para < 4: 52
#+end_example

#+name: gaia-match-distance
#+BEGIN_SRC python :results output
  import numpy as np
  import json
  import matplotlib.pyplot as plt
  from  astropy.table import Table
  import pandas as pd
  import seaborn as sns
  from scipy.stats import gaussian_kde
  
  <<read-gaia-distance-table>>
  <<qso-read-gaia-distance-table>>
  <<cv-read-gaia-distance-table>>
  
  lgd_kws = {'frameon': True, 'fancybox': True, 'shadow': True}
  
  # removing inf or nan values
  col = ["phot_g_mean_mag", "bp_rp"] 
  df_new = df_dis[col] 
  df_new1 =  df_new.dropna()
  
  # G-mag
  Gmag = np.array(df_new1["phot_g_mean_mag"]) 
  
  # Color
  #cbp_rpmag = df["phot_bp_mean_mag"] - df["phot_rp_mean_mag"]
  bp_rpmag = np.array(df_new1["bp_rp"])
  
  # Calculate the point density
  xy = np.vstack([bp_rpmag, Gmag])
  z = gaussian_kde(xy)(xy)
  
  # Sort the points by density, so that the densest points are plotted last
  idx = z.argsort()
  x, y, z = bp_rpmag[idx], Gmag[idx], z[idx]
  
  # QSO
  Gmag_qso = df_qso_dis["phot_g_mean_mag"]
  bp_rpmag_qso = df_qso_dis["bp_rp"]
  colors = ["cerulean",]
  colors = sns.xkcd_palette(colors)
  
#+END_SRC


#+BEGIN_SRC python :return pltfile :results file :results output
  
  <<gaia-match-distance>>
  
  # Absolute magnitude

  # removing inf or nan values
  col = ["rpgeo", "phot_g_mean_mag", "bp_rp"] 
  df_new = df_dis[col] 
  df_new1 =  df_new.dropna()

  # G-mag
  Gmag_abs = np.array(df_new1["phot_g_mean_mag"]) - 5*np.log10(np.array(df_new1["rpgeo"])) + 5
  
  # Color
  bp_rpmag = np.array(df_new1["bp_rp"])  

  # Creating new pandas table
  data = {'G_abs':Gmag_abs,
          'bp_rp':bp_rpmag}
  df_result = pd.DataFrame(data)
  
  df_result_new = df_result.dropna()
  
  G_abs = np.array(df_result_new["G_abs"])
  bp_rp = np.array(df_result_new["bp_rp"])
  # Calculate the point density
  xy = np.vstack([bp_rp, G_abs])
  z = gaussian_kde(xy)(xy)

  # Sort the points by density, so that the densest points are plotted last
  idx = z.argsort()
  x, y, z = bp_rp[idx], G_abs[idx], z[idx]

  # QSO
  Gmag_qso_abs = df_qso_dis["phot_g_mean_mag"] - 5*np.log10(np.array(df_qso_dis["rpgeo"])) + 5
  bp_rpmag_qso =  df_qso_dis["bp_rp"]
  colors = ["cerulean",]
  colors = sns.xkcd_palette(colors)

  pltfile = 'color-mag_abs-gaia-distance.jpg'
  sns.set_style('ticks')
  fig = plt.figure(figsize=(6, 7))
  ax = fig.add_subplot(111)
  
  ax.scatter(x, y, c=z, s=50, edgecolor=['none'])
  ax.scatter(bp_rpmag_qso, Gmag_qso_abs, c = colors, edgecolor=['black'], alpha = 0.4, s = 50)
  #ax.scatter(bp_rpmag_cv, Gmag_cv_abs, c = colors1, edgecolor=['black'], alpha = 0.9, s = 50)
  #plt.scatter(bp_rpmag, Gmag_abs, alpha=0.8)
  plt.xlabel(r'$G_{BP} - G_{RP}$')
  plt.ylabel(r'$M_G + A_G$')
  #ax.set_xlim(-30.0, 390.0)
  #ax.set_ylim(-90.0, 90.0)
  ax.legend(prop={'family': 'monospace', 'size': 'x-small'}, **lgd_kws)
  plt.gca().invert_yaxis()
  fig.savefig(pltfile)     
  
#+END_SRC

#+RESULTS:
[[file:Final-list]]

#+BEGIN_SRC python :return pltfile :results file :results output
  
  <<gaia-match-distance>>
  
  # Absolute magnitude

  # removing inf or nan values
  col = ["rpgeo", "phot_g_mean_mag", "phot_bp_mean_mag", "phot_rp_mean_mag", "bp_rp"] 
  df_new = df_dis[col] 
  df_new1 =  df_new.dropna()

  # G-mag
  Gmag_abs = np.array(df_new1["phot_g_mean_mag"]) - 5*np.log10(np.array(df_new1["rpgeo"])) + 5
  
  # Color
  bp_rpmag = np.array(df_new1["bp_rp"])  

  # Creating new pandas table
  data = {'G_abs':Gmag_abs,
          'bp_rp':bp_rpmag}
  df_result = pd.DataFrame(data)
  
  df_result_new = df_result.dropna()
  
  G_abs = np.array(df_result_new["G_abs"])
  bp_rp = np.array(df_result_new["bp_rp"])
  # Calculate the point density
  xy = np.vstack([bp_rp, G_abs])
  z = gaussian_kde(xy)(xy)

  # Sort the points by density, so that the densest points are plotted last
  idx = z.argsort()
  x, y, z = bp_rp[idx], G_abs[idx], z[idx]

  # QSO
  d_qso = np.array(df_qso_dis["rpgeo"]) / 1000.

  mask1 = d_qso <= 4.0
  mask2 = d_qso > 4.0
    
  # < 4 kpc
  Gmag_qso_abs1 = df_qso_dis["phot_g_mean_mag"][mask1] - 5*np.log10(np.array(df_qso_dis["rpgeo"][mask1])) + 5
  bp_rpmag_qso1 =  df_qso_dis["bp_rp"][mask1]
  colors1 = ["cerulean",]
  colors1 = sns.xkcd_palette(colors1)
  
  # > 4 kpc
  Gmag_qso_abs2 = df_qso_dis["phot_g_mean_mag"][mask2] - 5*np.log10(np.array(df_qso_dis["rpgeo"][mask2])) + 5
  bp_rpmag_qso2 =  df_qso_dis["bp_rp"][mask2]
  colors2 = ["light purple",]
  colors2 = sns.xkcd_palette(colors2) 

  # CV
  Gmag_cv_abs = df_cv_dis["phot_g_mean_mag"] - 5*np.log10(np.array(df_cv_dis["rpgeo"])) + 5
  bp_rpmag_cv =  df_cv_dis["bp_rp"]
  colors3 = ["pale yellow",]
  colors3 = sns.xkcd_palette(colors3) 
    
  pltfile = 'color-mag_abs-gaia-distance-cut.jpg'
  sns.set_style('ticks')
  fig = plt.figure(figsize=(6, 7))
  ax = fig.add_subplot(111)
  
  ax.scatter(x, y, c=z, s=40, edgecolor=['none'])
  ax.scatter(bp_rpmag_qso1, Gmag_qso_abs1, c = colors1, edgecolor=['black'], alpha = 0.7, s = 50, zorder=3, label = r"QSOs (D $\leq$ 4 kpc)")
  ax.scatter(bp_rpmag_qso2, Gmag_qso_abs2, c = colors2, edgecolor=['black'], alpha = 0.7, s = 50, label = "QSOs (D > 4 kpc)")
  ax.scatter(bp_rpmag_cv, Gmag_cv_abs, c = colors3, edgecolor=['black'], alpha = 0.8, s = 50, zorder=4, label = "CV")
  #ax.scatter(bp_rpmag_cv, Gmag_cv_abs, c = colors1, edgecolor=['black'], alpha = 0.9, s = 50)
  #plt.scatter(bp_rpmag, Gmag_abs, alpha=0.8)
  plt.xlabel(r'$G_{BP} - G_{RP}$')
  plt.ylabel(r'$M_G + A_G$')
  #ax.set_xlim(-30.0, 390.0)
  #ax.set_ylim(-90.0, 90.0)
  ax.legend(prop={'family': 'monospace', 'size': 'x-small'}, **lgd_kws)
  plt.gca().invert_yaxis()
  fig.savefig(pltfile)     
  
#+END_SRC

+ Now make the same plot using all sample with GAIA match.

#+BEGIN_SRC python :return pltfile :results file :results output
  
  <<gaia-match-distance>>
  
  # Absolute magnitude

  # removing inf or nan values
  col = ["rpgeo", "phot_g_mean_mag", "phot_bp_mean_mag", "phot_rp_mean_mag", "bp_rp"] 
  df_new = df_dis[col] 
  df_new1 =  df_new.dropna()

  # G-mag
  Gmag_abs = np.array(df_new1["phot_g_mean_mag"]) - 5*np.log10(np.array(df_new1["rpgeo"])) + 5
  
  # other mag
  bp = np.array(df_new1["phot_bp_mean_mag"]) 
  rp = np.array(df_new1["phot_rp_mean_mag"])
  
  # Color
  #bp_rpmag = np.array(df_new1["bp_rp"])  
  bp_rpmag = bp - rp

  # distance kpc
  d = df_new1["rpgeo"] / 1000.

  # Creating new pandas table
  data = {'G_abs':Gmag_abs,
          'bp_rp':bp_rpmag,
           'd':d}

 
  df_result = pd.DataFrame(data)
  
  df_result_new = df_result.dropna()
  
  # mask with distance
  mask1 = df_result_new["d"] <= 4.0
  mask2 = df_result_new["d"] > 4.0
   
  # d < 4 kpc
  G_abs1 = np.array(df_result_new["G_abs"][mask1])
  bp_rp1 = np.array(df_result_new["bp_rp"][mask1])
  colors1 = ["bright blue",]
  colors1 = sns.xkcd_palette(colors1)
  
  # d > 4 kpc
  G_abs2 = np.array(df_result_new["G_abs"][mask2])
  bp_rp2 = np.array(df_result_new["bp_rp"][mask2])
  colors2 = ["pale green",]
  colors2 = sns.xkcd_palette(colors2)

  pltfile = 'color-mag_abs-gaia-distance-classify.jpg'
  sns.set_style('ticks')
  fig = plt.figure(figsize=(6, 7))
  ax = fig.add_subplot(111)
  
  ax.scatter(bp_rp1, G_abs1, c = colors1, edgecolor=['black'], alpha = 0.7, s = 40, zorder=5, label = r"H$\alpha$ emitters with D $\leq$ 4 kpc")
  ax.scatter(bp_rp2, G_abs2, c = colors2, edgecolor=['black'], alpha = 0.5, s = 30, zorder=4, label = r"H$\alpha$ emitters  with D > 4 kpc")
 
  #ax.scatter(bp_rpmag_cv, Gmag_cv_abs, c = colors1, edgecolor=['black'], alpha = 0.9, s = 50)
  #plt.scatter(bp_rpmag, Gmag_abs, alpha=0.8)
  plt.xlabel(r'$G_{BP} - G_{RP}$')
  plt.ylabel(r'$M_G + A_G$')
  #ax.set_xlim(-30.0, 390.0)
  #ax.set_ylim(-90.0, 90.0)
  ax.legend(prop={'family': 'monospace', 'size': 'x-small'}, **lgd_kws)
  plt.gca().invert_yaxis()
  fig.savefig(pltfile)    

#+END_SRC

#+RESULTS:
[[file:Final-list]]


#+BEGIN_SRC python :return pltfile :results file :results output
  
  <<gaia-match-distance>>
  
  # Absolute magnitude

  # removing inf or nan values
  col = ["rpgeo", "phot_g_mean_mag", "bp_rp"] 
  df_new = df_dis[col] 
  df_new1 =  df_new.dropna()

  # G-mag
  d = np.array(df_new1["rpgeo"])
  
  # Color
  bp_rpmag = np.array(df_new1["bp_rp"])  

  # Creating new pandas table
  data = {'d':d,
          'bp_rp':bp_rpmag}
  df_result = pd.DataFrame(data)
  
  df_result_new = df_result.dropna()
  
  d_final = np.array(df_result_new["d"]) / 1000.
  bp_rp = np.array(df_result_new["bp_rp"])
  # Calculate the point density
  xy = np.vstack([bp_rp, d_final])
  z = gaussian_kde(xy)(xy)

  # Sort the points by density, so that the densest points are plotted last
  idx = z.argsort()
  x, y, z = bp_rp[idx], d_final[idx], z[idx]

  # QSO
  d_qso = np.array(df_qso_dis["rpgeo"]) / 1000.
  bp_rpmag_qso =  df_qso_dis["bp_rp"]
  colors = ["cerulean",]
  colors = sns.xkcd_palette(colors)

  pltfile = 'color-distance-gaia-Bailer.pdf'
  sns.set_style('ticks')
  fig = plt.figure(figsize=(6, 7))
  ax = fig.add_subplot(111)
  
  ax.scatter(x, y, c=z, s=50, edgecolor=['none'])
  ax.scatter(bp_rpmag_qso, d_qso, c = colors, edgecolor=['black'], alpha = 0.4, s = 50)
  #plt.scatter(bp_rpmag, Gmag_abs, alpha=0.8)
  plt.xlabel(r'$G_{BP} - G_{RP}$')
  plt.ylabel(r'$D (Kpc)$')
  #ax.set_xlim(-30.0, 390.0)
  #ax.set_ylim(-90.0, 90.0)
  ax.legend(prop={'family': 'monospace', 'size': 'x-small'}, **lgd_kws)
  plt.gca().invert_yaxis()
  fig.savefig(pltfile)     
  
#+END_SRC

#+RESULTS:
[[file:Final-list]]

#+BEGIN_SRC python :return pltfile :results file :results output
  
  <<gaia-match-distance>>
  
  # removing inf or nan values
  col = ["rpgeo"] 
  df_new = df_dis[col] 
  df_new1 =  df_new.dropna()
  
  d = df_new1["rpgeo"] / 1000.
  
  # QSOs from simbad
  df_qso_new = df_qso_dis[col] 
  df_qso_new1 =  df_qso_new.dropna()
  
  d_qso = df_qso_new1["rpgeo"] / 1000.
  
  pltfile = 'dist-distance-Bailer-gaia.jpg'
  with sns.axes_style("ticks"):
    # Bar diagram
    fig, ax1 = plt.subplots(1, 1, figsize=(10, 6), sharex=True)
    plt.xlabel(r"$D(Kpc)$", fontsize=33)
    plt.ylabel(r"Number", fontsize=33)
    plt.tick_params(axis='x', labelsize=33) 
    plt.tick_params(axis='y', labelsize=33)
    d = [x for x in d]
    sns.distplot(d,norm_hist=True, kde=True, ax=ax1,
		 bins=30, color='r', label = r"All H_${\alpha}$ emitters")

    d_qso = [x for x in d_qso]
    sns.distplot(d_qso, norm_hist=True, kde=True, ax=ax1,
		 bins=30, color='b', label = r"Known QSO in H_${\alpha}$ emitters list")
  
  
    ax1.set(xlim=[-1, 15])
    ax1.legend(loc='upper right')
    ymax = ax1.get_ybound()[1]
    sns.despine()
    plt.tight_layout()
    plt.savefig(pltfile)
  
  pltfile1 = 'dist-distance-Bailer-gaia-qso.jpg'
  with sns.axes_style("ticks"):
    # Bar diagram
    fig, ax2 = plt.subplots(1, 1, figsize=(10, 6), sharex=True)
    plt.xlabel(r"$D(Kpc)$", fontsize=33)
    plt.ylabel(r"Number", fontsize=33)
    plt.tick_params(axis='x', labelsize=33) 
    plt.tick_params(axis='y', labelsize=33)
    d = [x for x in d]
   
    d_qso = [x for x in d_qso]
    sns.distplot(d_qso, norm_hist=False, kde=False, ax=ax2,
		 bins=30, color='b', label = r"Known QSO in H_${\alpha}$ emitters list")
  
    ax2.set(xlim=[-1, 15])
    ax2.legend(loc='upper right')
    ymax = ax1.get_ybound()[1]
    sns.despine()
    plt.tight_layout()
    plt.savefig(pltfile1)
  
#+END_SRC

#+RESULTS:
[[file:Final-list]]

- Ploting the sample with negative parallax GAIA:

#+BEGIN_SRC python :return pltfile :results file :results output
  
  <<gaia-match>>
  
  d_qso = 1 / df_qso["parallax"] 
  mask = (d_qso > 0.0) & (d_qso <= 4.0)
  mask1 = d_qso < 0.0
  
 
  # QSO
  Gmag_qso = df_qso["phot_g_mean_mag"][mask]
  bp_rpmag_qso = df_qso["bp_rp"][mask]
  colors = ["cerulean",]
  colors = sns.xkcd_palette(colors)
  
  # QSO with negative parallax 
  Gmag_qso1 = df_qso["phot_g_mean_mag"][mask1]
  bp_rpmag_qso1 = df_qso["bp_rp"][mask1]
  colors1 = ["pale yellow",]
  colors1 = sns.xkcd_palette(colors1)
  
  
  #pltfile = 'color-mag-gaia-QSOdist.pdf'
  pltfile = 'color-mag-gaia-QSOdist.jpg'
  sns.set_style('ticks')
  fig = plt.figure(figsize=(6, 7))
  ax = fig.add_subplot(111)
  
  #ax.scatter(x, y, c=z, s=50, edgecolor=['none'])
  ax.scatter(bp_rpmag_qso, Gmag_qso, c = colors, edgecolor=['black'], alpha = 0.7, s = 50, zorder=3, label="QSO (d < 4 kpc)")
  ax.scatter(bp_rpmag_qso1, Gmag_qso1, c = colors1, edgecolor=['black'], alpha = 0.9, s = 50, label="QSO with negative parallax")
  #plt.scatter(bp_rpmag, Gmag, alpha=0.8)
  plt.xlabel(r'$G_{BP} - G_{RP}$')
  plt.ylabel(r'$G$')
  ax.set_xlim(-0.8, 3.4)
  ax.set_ylim(13, 22.3)
  ax.legend(prop={'family': 'monospace', 'size': 'x-small'}, **lgd_kws)
  plt.gca().invert_yaxis()
  fig.savefig(pltfile)     
  
#+END_SRC

** SIMBAD

 I took out the objects in SIMBAD table that have SDSS and Lamost spectra. The final file is:

: spectra-information-lamost-idsplus-non-spectra.csv

Now we count the objects by redshift range.


#+BEGIN_SRC python :results output
  from astropy.table import Table, vstack
  import pandas as pd
  from pathlib import Path
  import numpy as np


  ROOT_PATH = Path("paper/Figs")
  
  df = pd.read_csv("Final-list/spectra-information-lamost-idsplus-non-spectra.csv")
  print(df.columns)

  #How many are the local universe
  liml_z = df["redshift"] <= 0.02
  limu_z = df["redshift"] > 0.02

  print("Number the objects:", len(df))
  print("Number the objects with z < 0.02:", len(df[liml_z]))
  print("Number the objects with z > 0.02:", len(df[limu_z]))

#+END_SRC

#+RESULTS:
#+begin_example
Index(['Field', 'ID', 'RA', 'DEC', 'FWHM', 'ISOarea', 'KRON_RADIUS', 'MU_MAX',
       'nDet_PStotal', 'PhotoFlagDet', 'u_PStotal', 'J0378_PStotal',
       'J0395_PStotal', 'J0410_PStotal', 'J0430_PStotal', 'g_PStotal',
       'J0515_PStotal', 'r_PStotal', 'J0660_PStotal', 'i_PStotal',
       'J0861_PStotal', 'z_PStotal', 'e_u_PStotal', 'e_J0378_PStotal',
       'e_J0395_PStotal', 'e_J0410_PStotal', 'e_J0430_PStotal', 'e_g_PStotal',
       'e_J0515_PStotal', 'e_r_PStotal', 'e_J0660_PStotal', 'e_i_PStotal',
       'e_J0861_PStotal', 'e_z_PStotal', 'main_id', 'ra_x', 'dec_x',
       'coo_err_maj', 'coo_err_min', 'coo_err_angle', 'nbref', 'ra_sexa',
       'dec_sexa', 'main_type', 'other_types', 'radvel', 'redshift', 'sp_type',
       'morph_type', 'plx', 'pmra', 'pmdec', 'size_maj', 'size_min',
       'size_angle', 'B', 'V', 'R_x', 'J', 'H', 'K', 'u', 'g', 'r_xa', 'i',
       'z', 'angDist'],
      dtype='object')
Number the objects: 742
Number the objects with z < 0.02: 295
Number the objects with z > 0.02: 168
#+end_example

+ In total 206+33+168=407 objects have with high redshift (SDSS, LAMOST, SIMBAD). 

